#+TITLE: PostgreSql Notes

** Iniciar o serviÁo
   Tem v·rias maneiras de inicializar o postgresql. 
   No momento, na minha m·quina, como uso systemd, uso o seguinte
   comando
   sudo systemctl start postgresql-11.service
   sudo systemctl status postgresql-11.service
   #+NAME sudo systemctl start postgresql
   #+BEGIN_SRC sh :results output
   echo $ROOT_PASSWORD | sudo -S systemctl start postgresql-11.service
   echo $ROOT_PASSWORD | sudo -S systemctl status postgresql-11.service
   #+END_SRC

   #+RESULTS:
   #+begin_example
   ‚óè postgresql-11.service - PostgreSQL 11 database server
      Loaded: loaded (/usr/lib/systemd/system/postgresql-11.service; disabled; vendor preset: disabled)
      Active: active (running) since Sun 2019-01-06 01:05:33 -02; 7s ago
        Docs: https://www.postgresql.org/docs/11/static/
     Process: 5844 ExecStartPre=/usr/pgsql-11/bin/postgresql-11-check-db-dir ${PGDATA} (code=exited, status=0/SUCCESS)
    Main PID: 5849 (postmaster)
       Tasks: 8 (limit: 4394)
      Memory: 19.0M
      CGroup: /system.slice/postgresql-11.service
              ‚îú‚îÄ5849 /usr/pgsql-11/bin/postmaster -D /var/lib/pgsql/11/data/
              ‚îú‚îÄ5850 postgres: logger   
              ‚îú‚îÄ5852 postgres: checkpointer   
              ‚îú‚îÄ5853 postgres: background writer   
              ‚îú‚îÄ5854 postgres: walwriter   
              ‚îú‚îÄ5855 postgres: autovacuum launcher   
              ‚îú‚îÄ5856 postgres: stats collector   
              ‚îî‚îÄ5857 postgres: logical replication launcher   

   jan 06 01:05:31 Unknown systemd[1]: Stopped PostgreSQL 11 database server.
   jan 06 01:05:31 Unknown systemd[1]: Starting PostgreSQL 11 database server...
   jan 06 01:05:32 Unknown postmaster[5849]: 2019-01-06 01:05:32.414 -02 [5849] LOG:  listening on IPv6 address "::1", port 5432
   jan 06 01:05:32 Unknown postmaster[5849]: 2019-01-06 01:05:32.414 -02 [5849] LOG:  listening on IPv4 address "127.0.0.1", port 5432
   jan 06 01:05:32 Unknown postmaster[5849]: 2019-01-06 01:05:32.512 -02 [5849] LOG:  listening on Unix socket "/var/run/postgresql/.s.PGSQL.5432"
   jan 06 01:05:32 Unknown postmaster[5849]: 2019-01-06 01:05:32.706 -02 [5849] LOG:  listening on Unix socket "/tmp/.s.PGSQL.5432"
   jan 06 01:05:32 Unknown postmaster[5849]: 2019-01-06 01:05:32.991 -02 [5849] LOG:  redirecting log output to logging collector process
   jan 06 01:05:32 Unknown postmaster[5849]: 2019-01-06 01:05:32.991 -02 [5849] HINT:  Future log output will appear in directory "log".
   jan 06 01:05:33 Unknown systemd[1]: Started PostgreSQL 11 database server.
   #+end_example

** opcao -c pra enviar comandos
   #+NAME:setup                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      export host=45.79.225.175
      export user=postgres
   #+END_SRC

   #+RESULTS: setup

  
   #+NAME: psql -c '\x' -c 'SELECT * FROM foo;'
   #+BEGIN_SRC shell :session s1 :results output :exports both
    psql -h $host -U $user -c "drop database dbteste"
    psql -h $host -U $user -c '\x' -c 'create database dbteste'
   #+END_SRC

   #+RESULTS: psql -c '\x' -c 'SELECT * FROM foo;'
   : DROP DATABASE
   : Exibi√É¬ß√É¬£o expandida est√É¬° habilitada.
   : CREATE DATABASE

** opcao -f pra passar um arquivo sql pra execucao
   

   Considere o arquivo script-sql.sql com o seguinte conteudo

   #+INCLUDE: ./script-sql.sql :src sql

   
   #+NAME: psql -h $host -U $user -f script-sql.sql
   #+BEGIN_SRC shell :session s1 :results output :exports both
      psql -h $host -U $user -f script-sql.sql
      psql -h $host -U $user -d testdb -c "select * from clientes"
   #+END_SRC

   #+RESULTS: psql -h $host -U $user -f script-sql.sql
   #+begin_example
   psql:script-sql.sql:1: ERROR:  syntax error at or near "dropt"
   LINHA 1: dropt database testdb;
            ^
   CREATE DATABASE
   psql (11.6, servidor 12.1 (Debian 12.1-1.pgdg100+1))
   AVISO: psql vers√É¬£o 11, servidor vers√É¬£o 12.
            Algumas funcionalidades do psql podem n√É¬£o funcionar.
   Voc√É¬™ est√É¬° conectado agora ao banco de dados "testdb" como usu√É¬°rio "postgres".
   CREATE TABLE
   INSERT 0 4
   nome    | tipodecliente |      emaildocliente      
   -----------+---------------+--------------------------
    Huguinho  | vip           | wagnerdocri@gmail.com
    Zezinho   |               | 
    Luizinho  | vip           | wagnermarques@usp.br
    Luluzinha | vip           | denise.candria@gmail.com
   (4 registros)
   #+end_example

   #+RESULTS: psql -h $host -U $user
   : total 52
   : postgresql.org#'
   : -rwxrwxr-x. 1 wagner wagner 21115 jan 18 10:39  postgresql.org
   : -rw-rw-r--  1 wagner wagner   467 jan 18 10:39  script-sql.sql

